{"document": "The European Space Agency's Mars Express spacecraft has captured stunning new images of the Red Planet's surface, revealing intricate patterns of erosion and ancient river valleys. Scientists believe these geological features provide further evidence that Mars once had flowing water on its surface billions of years ago. The images show a region called Terra Sirenum, which contains some of the most well-preserved water-carved channels on Mars.", "summary": "ESA's Mars Express captured images of Mars showing ancient river valleys in Terra Sirenum, supporting evidence of past water flow."}
{"document": "Apple announced its quarterly earnings today, reporting revenue of $94.8 billion, up 8% from the same quarter last year. iPhone sales remained strong, accounting for 52% of total revenue. The company also saw significant growth in its Services division, which includes the App Store, Apple Music, and iCloud. CEO Tim Cook expressed optimism about the company's future product pipeline.", "summary": "Apple reported $94.8B quarterly revenue (up 8%), with iPhone leading at 52% of sales and Services growing significantly."}
{"document": "Researchers at MIT have developed a new battery technology that could charge electric vehicles in just 10 minutes while lasting for hundreds of thousands of miles. The breakthrough uses a solid-state design with lithium metal anodes, eliminating the fire risk associated with traditional lithium-ion batteries. The team expects commercial production to begin within five years.", "summary": "MIT researchers created a solid-state battery that charges EVs in 10 minutes, lasts hundreds of thousands of miles, with production expected in 5 years."}
{"document": "The World Health Organization released new guidelines recommending that adults get at least 150 minutes of moderate physical activity per week. The guidelines emphasize that even small amounts of movement can have health benefits, and that sedentary behavior should be minimized. The recommendations apply to all adults regardless of age, ability level, or fitness status.", "summary": "WHO recommends adults get 150+ minutes of moderate exercise weekly, noting any movement helps and sedentary time should be reduced."}
{"document": "Amazon Web Services announced the opening of its new data center region in Australia, featuring three availability zones across Sydney and Melbourne. The expansion is expected to reduce latency for Australian customers by up to 30% and create over 1,000 local jobs. AWS now operates 31 geographic regions globally.", "summary": "AWS opened new Australian data centers in Sydney and Melbourne, reducing latency 30% and creating 1,000+ jobs."}
{"document": "A team of marine biologists discovered a new species of deep-sea fish near the Mariana Trench at a depth of 8,000 meters. The fish, named Pseudoliparis marianus, has adapted to extreme pressure and complete darkness. Its transparent body and lack of swim bladder are unique adaptations for surviving at such depths.", "summary": "Scientists found new fish species Pseudoliparis marianus at 8,000m depth near Mariana Trench with unique pressure adaptations."}
{"document": "The city of Copenhagen has achieved its goal of becoming carbon neutral five years ahead of schedule. Through investments in renewable energy, public transportation, and green building standards, the Danish capital has reduced its carbon emissions by 80% since 2005. The city plans to continue its environmental initiatives with the goal of becoming completely fossil fuel-free by 2035.", "summary": "Copenhagen became carbon neutral 5 years early by cutting emissions 80% since 2005 through renewables and green infrastructure."}
{"document": "Netflix reported that its new password-sharing crackdown has resulted in a significant increase in new subscriptions. The streaming service added 5.9 million new subscribers in the last quarter, far exceeding analyst expectations of 2 million. The company also announced plans to invest $17 billion in original content next year.", "summary": "Netflix gained 5.9M new subscribers (vs 2M expected) after password-sharing crackdown, will invest $17B in content."}
{"document": "Scientists have successfully grown human brain organoids that developed functional eye structures, including light-sensitive cells. The miniature brain-like structures, about the size of a pea, could help researchers study vision disorders and test potential treatments. The breakthrough published in Cell Stem Cell journal represents a significant advance in organoid technology.", "summary": "Researchers grew pea-sized brain organoids with functional light-sensitive eye structures to study vision disorders."}
{"document": "Tesla unveiled its latest humanoid robot prototype, Optimus Gen 2, featuring improved walking capabilities and fine motor control. The robot can now perform delicate tasks like handling eggs without breaking them. Elon Musk stated that Tesla plans to begin limited production by late next year, with each unit expected to cost around $20,000.", "summary": "Tesla's Optimus Gen 2 robot has improved dexterity and walking, with $20,000 production planned for late next year."}
